[
  {
    "id": 1,
    "title": "Naruto Uzumaki",
    "preview": "Naruto Uzumaki (うずまきナルト, Uzumaki Naruto)",
    "fullText": "Naruto Uzumaki (うずまきナルト, Uzumaki Naruto) is a shinobi of Konohagakure's Uzumaki clan. He became the jinchūriki of the Nine-Tails on the day of his birth — a fate that caused him to be shunned by most of Konoha throughout his childhood. After joining Team Kakashi, Naruto worked hard to gain the village's acknowledgement all the while chasing his dream to become Hokage. In the following years, through many hardships and ordeals, he became a capable ninja regarded as a hero both by the villagers, and soon after, the rest of the world, becoming known as the Hero of the Hidden Leaf (木ノ葉隠れの英雄, Konohagakure no Eiyū, literally meaning: Hero of the Hidden Tree Leaves). He soon proved to be one of the main factors in winning the Fourth Shinobi World War, leading him to achieve his dream and become the village's Seventh Hokage (七代目火影, Nanadaime Hokage, literally meaning: Seventh Fire Shadow).",
    "personality1": "Naruto is noted as boisterous, exuberant, and unorthodox, quite similar to Hashirama Senju. He inherited his mother's verbal tic, as he ends his sentences with \"Dattebayo!\" (だってばよ!) when emotional. Though he responds best to competition and is not afraid to ask for assistance, Naruto is relatively naïve and slow to understand principles or situations. He often requires an oversimplified analogy in order to grasp explanations and can even prove forgetful. Naruto is aware of his faults and admits he acts strong to mask his embarrassment and frustration about them. Despite his naivety, Naruto can be quite observant, picking up on things others miss and retaining information casually gathered through conversation.",
    "personality2": "Growing up as an orphan who suffered years of hatred and social isolation has influenced Naruto's character in a number of ways: he is heedless to formality and social standings, addressing certain people with nicknames instead of honourifics, although by the time of his adulthood, Naruto has slightly outgrown this trait. He has picky eating habits of ramen, his favourite food; he has a perverted side that manifests as uses of the Sexy Technique or attempts to peep into women's baths. Despite his quirks and the criticism they earn him, Naruto is said to have a personality that draws people to him, inspiring friendship and loyalty through acts of genuine kindness that could change a person's world view and thus built meaningful relationships that he lacked in early life; the Sage of Six Paths believes Naruto's kindness is a special gift that allows him to save Kurama from its hatred. Naruto deeply cherishes these bonds and will go to great lengths to protect them, best seen with Sasuke after his defection from Konoha.",
    "personality3": " Naruto's time at the Falls of Truth revealed that a part of him hated the villagers for ostracising him, only to admire him after he saved them during Pain's Assault. Upon confronting it, he learned to be at peace with it, willingly becoming greater than what he suffered.Another of Naruto's prominent traits is his desire for acknowledgement; his pranks around the village were for people to notice him, even if it meant by scolding him. Therefore, he dreamed of one day becoming Konoha's Hokage, the epitome of acknowledgement and respect from everyone in the village. Knowing his dream is a long, arduous and seemingly impossible path, Naruto developed his own nindō of never going back on his word. This life-long philosophy serves as the cornerstone of Naruto's great self-confidence; he believes he can accomplish any goal with enough hard work and perseverance, no matter what. This trait guides him in many aspects of life, such as his promise to bring Sasuke back to Konoha. Over time, his goal to be Hokage grew from a desire for the acknowledgement of others to a desire to help and protect the people close to him, which Tobi attributed to the Will of Fire. His nindō has since been reinforced by his understanding that shinobi were meant to endure through hardships. His belief in hard work and perseverance made him detest shortcuts to achieving, as he disqualified his son from the Chūnin Exams for using the banned Kote, and expressed disgust at Momoshiki and Kinshiki Ōtsutsuki for their reliance on harvesting from Chakra Fruits to lazily gain power.",
    "image": "./pics/naruto.png",
    "image1": "./pics/naruto1.png",
    "image2": "./pics/naruto2.png"
  },
  {
    "id": 2,
    "title": "Sasuke Uchiha",
    "preview": "Sasuke Uchiha (うちはサスケ, Uchiha Sasuke)",
    "fullText": "Sasuke Uchiha (うちはサスケ, Uchiha Sasuke) is one of the last surviving members of Konohagakure's Uchiha clan. After his older brother, Itachi, slaughtered their clan, Sasuke made it his mission in life to avenge them by killing Itachi. He is added to Team 7 upon becoming a ninja and, through competition with his rival and best friend, Naruto Uzumaki, Sasuke starts developing his skills. Dissatisfied with his progress, he defects from Konoha so that he can acquire the strength needed to exact his revenge. His years of seeking vengeance and his actions that followed become increasingly demanding, irrational and isolates him from others, leading him to be branded as an international criminal. After learning the truth of his brother's sacrifice, later proving instrumental in ending the Fourth Shinobi World War, and being happily redeemed by Naruto, Sasuke decides to return to Konoha and dedicate his life to help protect the village and its inhabitants, becoming referred to as the \"Supporting Kage\" (支う影, Sasaukage, literally meaning: Supporting Shadow).",
    "personality1": "Sasuke was a happy child, eager to please and be worthy of his clan name. One of Sasuke's most significant bonds is the one he has with his older brother, Itachi, who by merely being mentioned can elicit strong reactions from Sasuke's otherwise calm demeanour. Sasuke adored Itachi when he was a boy, enjoying his company above all others'; as an infant, he would cry whenever he was held by someone besides Itachi and would immediately be happy once held by his big brother again. When Itachi murdered the rest of the Uchiha clan, Sasuke was crushed not only by the loss of his family but also by what Itachi told him: that he had never loved Sasuke. Sasuke devotes years of his life to avenging their family by killing Itachi, which Itachi encourages whenever they meet. ",
    "personality2": "At the same time however, he became determined to do so through his own means, including rejecting Itachi's instructions of obtaining the Mangekyō Sharingan for power, simply to not give Itachi the satisfaction. With his new outlook, he became cold toward others, unmoved by and uninterested in what they do or think of him, choosing instead to keep to himself. He stopped using honourifics, something considered rude in the Japanese language. His only goal in life became to take revenge for his clan's deaths by any means, even if it meant acquiring power that wasn't his own. In his pursuit for the power to take his revenge, whenever he meets new people, he makes an evaluation of their abilities: those he perceives to be weaker than himself he arrogantly disregards, giving them little attention so that they won't hold him back; those he perceives as stronger he fixates over and tries to surpass.",
    "personality3": " As a member of Team 7 he is repeatedly exposed to Kakashi Hatake's philosophy that there is strength in teamwork. For a time, Sasuke accepts this, experiencing it first-hand on several of Team 7's missions. He even become attached to his teammates and started to forget the vengeance he craved, achieving after so many years a measure of happiness. However, between both the manipulations of Orochimaru and meeting Itachi again in Part I, where he was and is utterly defeated, Sasuke decides to sever all ties to his village in a single-minded pursuit of power, leaving Konoha to focus solely on himself. Kakashi tried to help Sasuke realise the contradiction in his viewpoint: he is driven to gain power because he lost his family, yet sacrifices the family he still has (Team 7) in order to gain that power, which did have a profound impact on Sasuke and would have turned him away from the path of darkness had he not been influenced by the Sound Four. So focused on vengeance, he willingly accepted Orochimaru's offer of power, seeking out the Sannin to train Sasuke in all he knew, even allowing Orochimaru to experiment on him despite knowing the man was using him for his own gain. Ultimately however, Sasuke decided that letting himself be used by Orochimaru would be a disgrace to his clan, turning on Orochimaru and acquires new teammates with abilities that could further his goals. Sasuke initially retained his morals by setting a firm no-kill policy for himself and his team against those unrelated to his revenge and openly expressing disgust at Orochimaru for his horrific experiments. In addition, despite becoming cold towards his old team, Sasuke did become attached to his new teammates, still subconsciously holding a notion of teamwork, comparing them to the bond he had with Team 7 and pushing himself to extremes to save them.",
    "image": "./pics/sasuke.png",
    "image1": "./pics/sasuke1.png",
    "image2": "./pics/sasuke2.png"
  },
  {
    "id": 3,
    "title": "Sakura Haruno",
    "preview": "Sakura Uchiha (うちはサクラ, Uchiha Sakura, née Haruno (春野))",
    "fullText": "Sakura Uchiha (うちはサクラ, Uchiha Sakura, née Haruno (春野)) is a kunoichi of Konohagakure. When assigned to Team 7, Sakura quickly finds herself ill-prepared for the duties of a shinobi. However, after training under the Sannin Tsunade, she overcomes this, and becomes recognised as one of the greatest medical-nin in the world.",
    "personality1": "As a child, Sakura was insecure and highly self-conscious about her large forehead, covering it with her bangs. It was not until she met Ino, who defended her from bullies and became her friend, that she become more self-confident. At the start of Part I, Sakura typically gives the outward impression of being polite to her superiors, considerate of her peers, and confident in herself. She has occasional moments of bashfulness around Sasuke and competitiveness around Ino, but otherwise appears quite collected. This reservation, though never disingenuous, frequently masks how Sakura feels: in certain situations, she has pronounced feelings of delinquency, jealousy, and anger. Rather than display these emotions to others, she projects them inward, allowing a manifestation of who she truly is — what is labelled \"Inner Sakura\" (内なるサクラ, Uchi Naru Sakura) — to have the opinions Sakura wants to keep to herself.",
    "personality2": "As Part I progresses, Sakura becomes increasingly exposed to the realities of the world, difficulties for which she cannot rely upon Inner Sakura to cope with alone. When she was an Academy student, Sakura succeeded through studying alone to the point of pride, able to avoid physical trials and thus allowing her to focus on her physical appearance in a bid to appeal to Sasuke. As a shinobi, however, this is proven insufficient as her long hair can become a liability for opponents to exploit. Missions cannot be truly completed merely with book smarts, and it is necessary to be able to fight so that other shinobi will not kill her or her teammates.",
    "personality3": "The latter makes Sakura particularly disappointed in herself, as she is unable to contribute much in battle and must rely on Naruto and Sasuke to save her. She sets out to change this about herself, dedicating nearly three years of training to making herself as capable as Naruto and Sasuke; in the meantime, she becomes willing to sacrifice herself to protect them, coming to value them both very deeply. She looks to Naruto as a model for this goal, inspired by his rapid growth and his determination to be there for her and all those he held dear. When Sakura realises that she is as rude to Naruto as Sasuke usually is to her at his urging, she starts treating him better, cheering for his accomplishments, and confiding her hopes and fears with him.",
    "image": "./pics/sakura.png",
    "image1": "./pics/sakura1.png",
    "image2": "./pics/sakura2.png"
  },
  {
    "id": 4,
    "title": "Kakashi Hatake",
    "preview": "Kakashi Hatake (はたけカカシ, Hatake Kakashi)",
    "fullText": "Kakashi Hatake (はたけカカシ, Hatake Kakashi) is a shinobi of Konohagakure's Hatake clan. Famed as Kakashi of the Sharingan (写輪眼のカカシ, Sharingan no Kakashi), he is one of Konoha's most talented ninja, regularly looked to for advice and leadership despite his personal dislike of responsibility. To his students on Team 7, Kakashi teaches the importance of teamwork, a lesson he received, along with the Sharingan, from his childhood friend, Obito Uchiha. After the Fourth Shinobi World War, Kakashi becomes Konoha's Sixth Hokage (六代目火影, Rokudaime Hokage, literally meaning: Sixth Fire Shadow).",
    "personality1": "Since his early childhood, Kakashi was very independent and self-confident, at times even appearing arrogant and condescending. Despite that, Kakashi was very perceptive and intuitive, quickly realising the situation for what it was. After his father's death, Kakashi became more stern, aloof and cold toward others, following all the rules to the letter, chastising any who disobeyed them and being willing to abandon his comrades to finish missions.",
    "personality2": "As an adult, Kakashi typically has a relaxed and almost bored attitude, not prone to getting too worked up about anything or by anyone. Despite his increasingly growing reputation and prowess as a ninja, Kakashi has shown no signs of arrogance, and is rather modest about his abilities. He is habitually tardy, showing up when it suits him, using excuses that convince nobody, and later leaving for equally poor reasons. Though Kakashi wants others to believe this is how he always acts, he only does so for matters that aren't of particular importance.",
    "personality3": "In truth, Kakashi is rather a solitary and matter-of-fact person. Kakashi is still just as apathetic as he was during his youth, often speaking bluntly about sensitive topics and occasionally ignores his fellow classmates, whenever he passed by them. He is alone for most of his spare time, spending hours visiting Rin Nohara's grave or the Memorial Stone where Obito Uchiha's name is engraved. He tells them about his life, recent events in Konoha, and others they knew, but mostly he shares his regrets that they cannot be with him or that their deaths were his fault. In the anime, after Rin died, Kakashi went through a period of post-traumatic stress disorder, having nightmares about her death and growing depressed whenever others mentioned her. Over time, Kakashi comes to accept that Rin chose to die, so his guilt instead became more about his broken promise to Obito to keep Rin safe. ",
    "image": "./pics/kakashi.png",
    "image1": "./pics/kakashi1.png",
    "image2": "./pics/kakashi2.png"
  },
  {
    "id": 5,
    "title": "Rock Lee",
    "preview": "Rock Lee (ロック・リー, Rokku Rī)",
    "fullText": "Rock Lee (ロック・リー, Rokku Rī) is a shinobi of Konohagakure's Lee clan and a member of Team Guy. Unlike most shinobi, he lacked the skills necessary to use ninjutsu or genjutsu. However, he overcomes those shortcomings by undergoing special training from Might Guy that would make him a taijutsu master while still a genin.",
    "personality1": "Under Guy's leadership, Lee has acquired a number of his sensei's personality traits: he is energetic, optimistic, and hot-blooded, and shows the epitome of a \"nice guy\". He believes that one cannot dislike food and shows strong dedication to his promises; when this promise is broken, just barely, he assigns himself arduous training to prevent it from happening again. Lee speaks respectfully to others, never using contractions or swear words and always addressing people with appropriate honourifics (except his teammates, since Lee feels they are close enough to be spoken to informally). He also carries a small book and pencil to recall advice that Guy gives him over time.",
    "personality2": "Despite his passionate nature, Lee has also shown strong instincts, staying focused at the task at hand and rarely losing his composure. He has a keen sense of honour and respects his opponents, refusing to hold grudges against those who have defeated him, and returning favours to those that have helped him. This was shown by his befriending of Gaara, forgiving him for crushing his arm and leg — injuries that nearly ended his career as a shinobi. Lee feels others should show the same respect towards their opponents, and is disgusted whenever someone is unnecessarily cruel to their enemies.",
    "personality3": "One of Lee's recurring themes throughout the series is his drive to succeed, believing with enough hard work and perseverance, he can surpass a natural genius. He can be prone to depression when faced with setbacks. Neji, Lee's more talented teammate and rival, found Lee's efforts to be in vain, believing a \"failure\" could never defeat a \"genius\". As such, Lee became determined to defeat Neji in order to prove him wrong, though was met with defeat every time. When Neji himself was defeated by Naruto Uzumaki, another so-called \"failure\", he rejects his belief in fate and now holds great respect for Lee, believing that he will surpass the gifted with enough work.",
    "image": "./pics/lee.png",
    "image1": "./pics/lee1.png",
    "image2": "./pics/lee2.png"
  },
  {
    "id": 6,
    "title": "Hinata Hyūga",
    "preview": "Hinata Uzumaki (うずまきヒナタ, Uzumaki Hinata, née Hyūga (日向))",
    "fullText": "Hinata Uzumaki (うずまきヒナタ, Uzumaki Hinata, née Hyūga (日向)) is a kunoichi of Konohagakure. Formerly the heiress of the Hyūga clan, she lost the position upon being deemed unsuited for the responsibilities of leading the clan. Nonetheless, Hinata persevered and from her observation of Naruto Uzumaki especially, Hinata found an example to follow. Through her membership with Team 8, she sought to become strong enough to change herself, if even a little at a time. A few years after the Fourth Shinobi World War, Hinata joined the Uzumaki clan after marrying Naruto.",
    "personality1": "As a child, Hinata was soft-spoken and polite, always addressing people with proper honourifics. She is kind, always thinking of others more than for herself, caring for their feelings and well-being. She doesn't like being confrontational for any reason. This led to her being meek or timid to others, as her overwhelming kindness can render her unable to respond or act for fear of offending somebody. Her father's constant push to alter this personality trait when she was younger only made it worse, eroding Hinata's self-confidence and making her even more bashful because she gained so little faith in herself and opinions. Despite being disinherited, Hinata loves her family very much, as shown when she \"agreed\" to marry Toneri in order to rescue Hanabi even though she knew it meant breaking Naruto's heart and the possibility she and Toneri actually would get married.",
    "personality2": "Hinata's outlook sees a shift after her appointment to Team 8. Whereas her father and much of the Hyūga clan had decided she was a lost cause who would never amount to anything, her team considers her a valuable member with her special strong points. Originally, she would over-rely on her teammates, looking to them in times of difficulty to save her from situations that make her uncomfortable. It is for her teammates - among other reasons - that Hinata starts seeking to change herself, as she wishes to help the team rather than burden it.",
    "personality3": "Hinata's primary motivation is Naruto Uzumaki, with whom she has been fascinated since meeting him. He initially gained her attention because of his kindness to her and outspoken nature, and then kept her attention because of similarities that Hinata perceived to herself: Naruto had a painful childhood without the love of parents, a fate worse than the mere difficulty she had with her own father, and he craves the attention and acknowledgement of anybody, just as Hinata wants to please her father. But whereas Hinata lost faith in herself, Naruto always believed he can accomplish any given task if he tries hard enough. She admires him deeply for this courage and over time fell deeply in love with him, which manifests as increased shyness and speechlessness when around him, something that became apparent to everyone, apart from ironically Naruto himself.",
    "image": "./pics/hinata.png",
    "image1": "./pics/hinata1.png",
    "image2": "./pics/hinata2.png"
  },
  {
    "id": 7,
    "title": "Ino Yamanaka",
    "preview": "Ino Yamanaka (山中いの, Yamanaka Ino)",
    "fullText": "Ino Yamanaka (山中いの, Yamanaka Ino) is a kunoichi of Konohagakure's Yamanaka clan. She and her fellow members of Team Asuma are their generation's Ino–Shika–Chō trio.",
    "personality1": "From a young age, Ino has been confident, bold, and outspoken girl who had a mild-temper and occasionally lashed out at others if their personal habits bothered her. At the same time, she was by nature very friendly and loyal to her allies, usually more motivated than her team-mates, and tended to take charge of them, a characteristic she would later pass on to her son, Inojin. Shikamaru, despite finding most girls \"troublesome\", typically offers no resistance to Ino's forceful behaviour, being unwilling to deal with her reaction if things don't happen her way. She is also prideful in her appearance and often tries to lose weight by dieting in the hopes that it will make her more attractive to boys; she even jokingly suggests that Chōji should do the same to attract girls. Ino is quite knowledgeable about different types and meanings of flowers, sometimes making analogies to them when talking.",
    "personality2": "Despite her assertiveness and uppity demeanour, Ino is a compassionate and kind person at heart, having been raised to embody the meaning of the bush clover: a blunt, candid love who treasures the bonds with her friends. It is these qualities that earned Sakura Haruno's friendship, defending Sakura from bullies who teased her and helping her become confident. Their warm friendship developed into a bitter rivalry over the following years, fuelled by competition for Sasuke's affections, ninjutsu and even trading insults, with Ino as \"Ino-pig\" (いのぶた, Ino-buta) and Sakura as \"Forehead Girl\" (デコリーン, Dekorīn, English TV: Billboard Brow).",
    "personality3": "After the Chūnin Exams, Ino becomes impressed by Sakura's growth and they rekindle their friendship, while maintaining their rivalry on more amiable terms. She cares greatly for her teammates as well, being relieved that they survived after the failed Sasuke Recovery Mission, promising her sensei Asuma Sarutobi to look after them after he dies, and during the Fourth Shinobi World War, encouraging them to stay strong in the face of danger. By the time of his death, Inoichi believed that Ino had truly blossomed into the bush clover of the Yamanaka Clan, and is proud of her bonds with her friends.",
    "image": "./pics/ino.png",
    "image1": "./pics/ino1.png",
    "image2": "./pics/ino2.png"
  },
  {
    "id": 8,
    "title": "Itachi Uchiha",
    "preview": "Itachi Uchiha (うちはイタチ, Uchiha Itachi)",
    "fullText": "Itachi Uchiha (うちはイタチ, Uchiha Itachi) was a shinobi of Konohagakure's Uchiha clan who served as an Anbu Captain. He later became an international criminal after murdering his entire clan, sparing only his younger brother, Sasuke. He afterwards joined the international criminal organisation known as Akatsuki, whose activity brought him into frequent conflict with Konoha and its ninja — including Sasuke who sought to avenge their clan by killing Itachi. Following his death, Itachi's motives were revealed to be more complicated than they seemed and that his actions were only ever in the interest of his brother and village, making him remain a loyal shinobi of Konohagakure to the very end.",
    "personality1": "From a young age, Itachi was calm and insightful, showing noticeable maturity for his age and knowledge on how to deal with every situation. For all his accomplishments, talent, and fame, Itachi was a rather humble man. Never arrogant about his own abilities nor underestimating others, most things he said would be unbiased and accurate. If an opponent exceeded his expectations or posed a legitimate challenge to him or his allies, Itachi would freely admit it. As a seven-year-old, his reasoning was on par with a Hokage. Having studied history, not just of his clan or his village but of the world, he gained a broader appreciation of what was important. Learning so much enabled him to understand how events of the past came to happen and, when he applied that same understanding into the future, he became concerned for where things were going. At the same time, Itachi was still fairly naïve as a child in many real-world scenarios and as such was willing to learn from his peers on how to differentiate situations. He lived at a distance, observing individuals and ideas without getting directly involved so that he could fully understand them.",
    "personality2": "Although this approach prevented him from becoming close with many people, it enabled him to think and act without prejudice or preconceptions, instead evaluating things strictly on their own merits. In the anime, Itachi unintentionally gained many friends and admirers for his genuine concern for others despite his passive nature. He would think about shinobi and origins of the village and its future. For this reason, he never became arrogant about his own abilities or accomplishments; to which, most views or statements he made were usually well-based, seeing the situation for what it was. From this he had no self-righteous loyalty to his clan that was so common among the Uchiha; though he loved his family and wanted the best for them, he knew there were more important things than the Uchiha's personal aspirations. Itachi's dream was to become Hokage, though he kept it hidden from others. Itachi was also one of the few villagers of Konoha to hold no grudge against Naruto Uzumaki, believing Naruto to be the greatest victim of the Nine-Tails attack and showed him kindness whenever they met by chance.",
    "personality3": "A pacifist at heart, Itachi did not actually like fighting and would avoid it when he could. When he couldn't, he would end the fight as quickly as possible, all the while holding himself back as much as possible. Despite this, Itachi felt his own needs were secondary to the greater good's and to that end he became a shinobi. He trained tirelessly to improve himself as quickly as he could and subjected himself to all of the shinobi life's inconveniences without complaint for the simple motivation of being useful to others. His commitment borderlined recklessness, due to training privately using extremely deadly methods such as dodging a barrage of kunai in the anime. Being so accomplished as a ninja enabled Itachi to approach problems less violently than others would, satisfying his peace-loving nature.",
    "image": "./pics/itachi.png",
    "image1": "./pics/itachi1.png",
    "image2": "./pics/itachi2.png"
  },
  {
    "id": 9,
    "title": "Shikamaru Nara",
    "preview": "Shikamaru Nara (奈良シカマル, Nara Shikamaru)",
    "fullText": "Shikamaru Nara (奈良シカマル, Nara Shikamaru) is a shinobi of Konohagakure's Nara clan. Though lazy by nature, Shikamaru has a rare intellect that consistently allows him to prevail in combat. The responsibilities that these successes leave him with cause him frequent annoyance, but he gladly accepts them so that he may be of service to his fellow members of Team Asuma, and to prove himself to generations of the past and future.",
    "personality1": "Shikamaru is naturally a lazy person and his inclination is to do as little work as possible. As an Academy student and even during his early career as a genin, Shikamaru is able to get away with this, spending his days sleeping, watching the clouds, or playing games of shōgi and Go. His goal is to live unremarkably, free of anything of noticeably good or bad, and then to die just as unremarkably as he lived. When he is faced with the potential for conflict or commitment, he responds first by saying, \"how troublesome\" and then by trying to find some way out of it, either by pretending to be indisposed or even outright saying that he doesn't want to do whatever it is.",
    "personality2": "Although Shikamaru describes himself as \"the number one coward\", he has a strong moral compass and dedication to his friends. It is these qualities that earned Chōji Akimichi's friendship, as Shikamaru was one of the first people to look past his weight and find value in who he naturally was. It is also these qualities that force Shikamaru to move away from his lazy pursuits, as he finds himself volunteering to do work or to sacrifice himself if it will in some way benefit his allies. Such selflessness, once displayed during the Konoha Crush, exacerbates his \"troublesome\" situations: he is given the responsibility of leading his friends into battle, for which reason he does everything that he can to keep them safe, for which reason he is given even more responsibility over even more of his friends, and so on. He still clings to his lazy origins as much as he can; even if he can't spend his entire day being idle, he at least avoids having long-term goals or confessing any particular pleasure in the duties he's assigned.",    "personality3": "Shikamaru undergoes a rapid maturity after the death of his teacher, Asuma Sarutobi, whose loss forces Shikamaru to recognise that the world is not safe that he cannot be kept protected from it forever. After avenging Asuma, Shikamaru takes it upon himself to do all that he can to make things better for future Konoha generations, especially Asuma's then-unborn daughter, Mirai; such is the Will of Fire. He may still balk at the prospect of the work he must do, but he no longer runs from it, even going so far as to argue in favour of difficult choices if it will guarantee his friends' and village's survival. In Shikamaru Hiden, he describes his new goal in life as, rather than living unremarkably himself and watching the clouds all the time, to instead make a world where his children or grandchildren can live that way if they choose to.",
    "image": "./pics/shikamaru.png",
    "image1": "./pics/shikamaru1.png",
    "image2": "./pics/shikamaru2.png"
  },
  {
    "id": 10,
    "title": "Neji Hyūga",
    "preview": "Neji Hyūga (日向ネジ, Hyūga Neji)",
    "fullText": "Neji Hyūga (日向ネジ, Hyūga Neji) was a shinobi of Konohagakure's Hyūga clan. Though a prodigy even by the Hyūga's standards, Neji was a member of the clan's branch house; no matter how skilled he became, he would always be in service to the Hyūga's main house, a fact that convinced him fate was predetermined. After experiencing Naruto Uzumaki's refusal to be limited by such an ideology, Neji realised his fate was what he chose it to be, and as a member of Team Guy he sought the strength necessary to make the future he wanted for his family and friends, and ultimately sacrificed his life to protect the very same person who taught him about the freedom of one's choice of fate, Naruto.",
    "personality1": "As a child, Neji was kind and prone to smiling; on Hinata's third birthday, he confided to his father that he thought she was cute. He lost these qualities after his father's death, growing serious and cold, more mature than most his age. For years he was driven by a fatalistic belief that his and everyone else's fates were determined from birth and were inescapable. He perceived his own destiny as being that of a rare talent, causing him to arrogantly place himself above those he believes are \"weaker\" than himself. He also perceived that his talents would always be handicapped by mandatory servitude to the Hyūga's main house, which he resented and it fuelled his animosity towards the main house and its members.",
    "personality2": "Neji shared his philosophy about fate with those he met, gladly telling them when they are straying from the paths that have been set out for them by, for example, trying to exceed their natural limitations or trying to defeat him in combat when they lack any obvious ability to do so. When he shared his philosophy with Hinata, she concluded that his insistence upon destiny was actually a sore spot for him that caused him inner suffering: he so badly wanted to prove himself to the main house yet feels incapable of doing so. Neji attempted to kill her in anger for her words. Naruto Uzumaki also disagreed with Neji, claiming that Neji was not realising his destiny because he was in fact holding himself back. Neji initially scoffed at Naruto's suggestion, but he was forced to reevaluate when Naruto, a \"failure\", defeats him, a \"genius\", in a fight.",
    "personality3": "From his experience with Naruto, Neji felt that fate is not inescapable but that, rather, one's destiny is what one makes of it; he felt indebted to Naruto for releasing him from his prior \"darkness\". The destiny Neji ended up selecting for himself was to become strong enough to never lose again, although his inevitable destiny would soon come to hold true. In pursuit of this goal he trained with his teammates, whose own dreams he became supportive of, and later with members of the main house, whom he gradually started mending relations with. Over time his desire to get stronger became as much a motivation to never lose as it is to protect his friends and family. In particular, he embraced his responsibility as a member of a branch house to keep Hinata safe, showing greater concern for her than anyone else in combat situations and, ultimately, giving his life to save hers.",
    "image": "./pics/neji.png",
    "image1": "./pics/neji1.png",
    "image2": "./pics/neji2.png"
  },
  {
    "id": 11,
    "title": "Kiba Inuzuka",
    "preview": "Kiba Inuzuka (犬塚キバ, Inuzuka Kiba)",
    "fullText": "Kiba Inuzuka (犬塚キバ, Inuzuka Kiba) is a member of Konohagakure's Inuzuka clan and a member of Team Kurenai. Despite his headstrong, and at times egotistic attitude, Kiba is loyal to his comrades and will do anything to protect them with his trusted canine companion, Akamaru, by his side.",
    "personality1": "Kiba is often short-tempered and impulsive (in stark contrast to his teammates Shino and Hinata), and can be prone to making mistakes when he becomes agitated in battle. He also enjoys combat even when facing particularly strong opponents. He cares deeply for Akamaru, and is willing to do whatever is necessary to protect him. And, despite his rather gruff attitude, many of Kiba's actions reveal that he is very close to his older sister, Hana, and remains fiercely loyal to his clan and has great pride in it.",
    "personality2": "Back at his academy days, Shino always considered Kiba a \"problem child\", and wanted to be assigned to a team with anyone but him because of how different their personalities were to each other. Even after becoming a team, Kiba often argues with Shino over what course of action the group should take, particularly when Shino advises caution. Kiba often sees himself as the group leader, and becomes offended at any of Shino's actions that he perceives as challenging his leadership. It seems that there was a contest for leadership of Team 8 during the Chūnin Exams, as Kiba said Hinata voted for him. Despite his disagreements with Shino, he is very close to him, and respects his fighting capabilities. Shino on the other hand came to consider Kiba his best friend, and a partner whom he could trust more than anyone else by his side. Despite Shino's own stoic personality, he has shown a rather humorous side of his around Kiba, especially when he occasionally teases Kiba whenever he's boasting about how he's a suitable candidate for Hokage.",
    "personality3": "Kiba has became extremely close to his other teammate, Hinata, and acts rather brotherly toward her, but tends to worry about her, urging her to be strong before the second phase of the exam, and to forfeit rather than face a dangerous opponent. Kiba also seems to be quite protective of her, although he insists that Hinata is not someone who can't take care of herself. Kiba is also one of the first few people to get to know about Hinata's crush on Naruto Uzumaki, and has been quite supportive of that. Kiba likes to playfully tease Hinata about her affections for Naruto. This usually includes telling her that Naruto is nearby, or just mentioning her reactions to him to other people, much to her embarrassment. Despite this, they have a very strong friendship. Kiba also seemed to be quite excited over Hinata and Naruto's wedding, and wanted to be the one, along with Shino and Akamaru, to bring them the best present out of all the people attending their wedding, so they could make Hinata happy. Kiba dubbed it as the Team 8's last mission, something that only members of their team would be involved in, who had been through all the happiness and sorrow with each other.",
    "image": "./pics/kiba.png",
    "image1": "./pics/kiba1.png",
    "image2": "./pics/kiba2.png"
  },
  {
    "id": 12,
    "title": "Gaara",
    "preview": "Gaara (我愛羅, Gaara)",
    "fullText": "Gaara (我愛羅, Gaara) is a shinobi of Sunagakure. He was made the jinchūriki of the One-Tailed Shukaku before he was born, causing the villagers of Suna to fear him as a monster. With nobody to connect to, Gaara grew up hating the world and looking out only for himself, giving his life meaning by killing anyone he came across. After being defeated by Naruto Uzumaki — a jinchūriki like himself who found strength in his friendships — Gaara starts emulating him. He becomes Suna's Fifth Kazekage (五代目風影, Godaime Kazekage, literally meaning: Fifth Wind Shadow) so that he can protect the village and all those who live there, dispelling the fears he cast on the villagers.",
    "personality1": "Gaara was consistently warm to others during his early life. Although most of Suna's villagers feared and despised him, he was able to persevere due to the love that he felt from Yashamaru and his mother. His father, Rasa, believed these niceties were impeding Gaara's development as a jinchūriki and as such had both taken from him: he ordered Yashamaru to try and kill Gaara and, if he were to fail, to tell Gaara that neither he nor Gaara's mother had ever loved him. Rasa's plan succeeded, as following Yashamaru's death Gaara stopped trying to connect with people. Rather, Gaara focused on himself, driven solely by his own desires and his own survival.",
    "personality2": "During his years of caring only about himself, Gaara becomes infamously known as \"Gaara of the Sand Waterfall\" (砂瀑の我愛羅, Sabaku no Gaara, English TV: Gaara of the Desert). Though he outwardly appears calm, \"Gaara of the Sand Waterfall\" is deeply unbalanced, completely unmoved by others' pleas for mercy and, in certain situations, driven mad with bloodlust. This behaviour is partly due to Shukaku, whose voice Gaara alone can hear in his head, who encourages violence at every opportunity, and who torments Gaara with threats to take control of his body if he falls asleep, thus making Gaara an insomniac. But Shukaku is not wholly responsible: Gaara simply hates other people for existing, believing that so long as they are alive they are a threat to his own life. His purpose, therefore, is to kill anyone who is strong or whom he perceives as similar to himself, as only by killing them can he assert his own existence. With those who do not interest him, Gaara is typically withdrawn and silent. When he must interact with them, he does so with open disregard for their feelings and often threatens to kill them, even his own siblings, if they become too much of a nuisance to him.",
    "personality3": "Gaara's background is very similar to that of Naruto Uzumaki: both have been jinchūriki since the day they were born, both were hated by almost everyone in their village, and both were raised without a parent's love. But whereas Gaara eventually gave up on other people, Naruto continued trying to win the acknowledgement of his peers and village, pursuits he eventually succeeds at. Whereas Gaara seeks strength only in protecting himself, Naruto seeks strength in protecting the friends he makes. When the two fight during the Konoha Crush and Naruto defeats Gaara, Gaara takes this as proof that his own choices in life were wrong; he had surrendered to his difficult circumstances too easily. From that point onward he starts moving away from \"Gaara of the Sand Waterfall\" and starts emulating Naruto instead, improving his relationships with his siblings, making friends within Suna and without, and finding something that he's willing to give his life to protect. His relationship with Shukaku did improve somewhat when he told the tailed beast he used to hate it, but was grateful to the beast because he was able to meet Naruto due to the painful life Shukaku made him endure.",
    "image": "./pics/gaara.png",
    "image1": "./pics/gaara1.png",
    "image2": "./pics/gaara2.png"
  }
]